### Ordinal Encoding
#### Ordinal Encoding means giving rank to categories based on their importance

In [3]:
import datetime as dt

In [8]:
today_date=dt.datetime.today()

In [9]:
today_date

datetime.datetime(2020, 11, 24, 6, 40, 52, 650239)

In [11]:
today_date-dt.timedelta(1) ## timedelta() give the difference between 1 day

datetime.datetime(2020, 11, 23, 6, 40, 52, 650239)

In [17]:
days=[]
for i in range(1,15):
    days.append(today_date-dt.timedelta(i))

In [18]:
days

[datetime.datetime(2020, 11, 23, 6, 40, 52, 650239),
 datetime.datetime(2020, 11, 22, 6, 40, 52, 650239),
 datetime.datetime(2020, 11, 21, 6, 40, 52, 650239),
 datetime.datetime(2020, 11, 20, 6, 40, 52, 650239),
 datetime.datetime(2020, 11, 19, 6, 40, 52, 650239),
 datetime.datetime(2020, 11, 18, 6, 40, 52, 650239),
 datetime.datetime(2020, 11, 17, 6, 40, 52, 650239),
 datetime.datetime(2020, 11, 16, 6, 40, 52, 650239),
 datetime.datetime(2020, 11, 15, 6, 40, 52, 650239),
 datetime.datetime(2020, 11, 14, 6, 40, 52, 650239),
 datetime.datetime(2020, 11, 13, 6, 40, 52, 650239),
 datetime.datetime(2020, 11, 12, 6, 40, 52, 650239),
 datetime.datetime(2020, 11, 11, 6, 40, 52, 650239),
 datetime.datetime(2020, 11, 10, 6, 40, 52, 650239)]

In [19]:
import pandas as pd

In [24]:
df=pd.DataFrame(days)
df.columns=["Day"]

In [25]:
df

                          Day
0  2020-11-23 06:40:52.650239
1  2020-11-22 06:40:52.650239
2  2020-11-21 06:40:52.650239
3  2020-11-20 06:40:52.650239
4  2020-11-19 06:40:52.650239
5  2020-11-18 06:40:52.650239
6  2020-11-17 06:40:52.650239
7  2020-11-16 06:40:52.650239
8  2020-11-15 06:40:52.650239
9  2020-11-14 06:40:52.650239
10 2020-11-13 06:40:52.650239
11 2020-11-12 06:40:52.650239
12 2020-11-11 06:40:52.650239
13 2020-11-10 06:40:52.650239

In [36]:
dicty={"Monday":1,"Tuesday":2,"wednesday":3,"Thursday":4,"Friday":5,
      "Saturday":6,"Sunday":7
     }

In [44]:
dicty

{'Monday': 1,
 'Tuesday': 2,
 'wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [45]:
df['weekdays']=df['Day'].dt.weekday_name

In [46]:
df.head()

                         Day  weekdays  Week_ordinal
0 2020-11-23 06:40:52.650239    Monday           1.0
1 2020-11-22 06:40:52.650239    Sunday           7.0
2 2020-11-21 06:40:52.650239  Saturday           6.0
3 2020-11-20 06:40:52.650239    Friday           5.0
4 2020-11-19 06:40:52.650239  Thursday           4.0

In [47]:
df['Week_ordinal']=df['weekdays'].map(dicty)

In [50]:
df.head()

                         Day  weekdays  Week_ordinal
0 2020-11-23 06:40:52.650239    Monday           1.0
1 2020-11-22 06:40:52.650239    Sunday           7.0
2 2020-11-21 06:40:52.650239  Saturday           6.0
3 2020-11-20 06:40:52.650239    Friday           5.0
4 2020-11-19 06:40:52.650239  Thursday           4.0

### Count or Frequency Encoding

In [64]:
df = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', header = None,index_col=None) 
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [65]:
cols=[1,3,5,6,7,8,9,13]

In [66]:
df=df[cols]

In [67]:
df.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [68]:
df.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [69]:
## now check how many labels each feature has.

for feature in df.columns:
    print(feature,":",len(df[feature].unique())," labels")

Employment : 9  labels
Degree : 16  labels
Status : 7  labels
Designation : 15  labels
family_job : 6  labels
Race : 5  labels
Sex : 2  labels
Country : 42  labels

In [72]:
getCount=df['Country'].value_counts().to_dict()

In [73]:
getCount

{' United-States': 29170,
 ' Mexico': 643,
 ' ?': 583,
 ' Philippines': 198,
 ' Germany': 137,
 ' Canada': 121,
 ' Puerto-Rico': 114,
 ' El-Salvador': 106,
 ' India': 100,
 ' Cuba': 95,
 ' England': 90,
 ' Jamaica': 81,
 ' South': 80,
 ' China': 75,
 ' Italy': 73,
 ' Dominican-Republic': 70,
 ' Vietnam': 67,
 ' Guatemala': 64,
 ' Japan': 62,
 ' Poland': 60,
 ' Columbia': 59,
 ' Taiwan': 51,
 ' Haiti': 44,
 ' Iran': 43,
 ' Portugal': 37,
 ' Nicaragua': 34,
 ' Peru': 31,
 ' France': 29,
 ' Greece': 29,
 ' Ecuador': 28,
 ' Ireland': 24,
 ' Hong': 20,
 ' Trinadad&Tobago': 19,
 ' Cambodia': 19,
 ' Thailand': 18,
 ' Laos': 18,
 ' Yugoslavia': 16,
 ' Outlying-US(Guam-USVI-etc)': 14,
 ' Hungary': 13,
 ' Honduras': 13,
 ' Scotland': 12,
 ' Holand-Netherlands': 1}

In [74]:
df['Country']=df['Country'].map(getCount)

In [76]:
df.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

#### Advantages
1.Easy to implement
2.Not required any new feature space
#### Disadvantages
1.not able to work when two categories has same frequency.

### Target Guided Ordinal Encoding

1.Ordering the labels according to the target.

2.Replace the labels by the joint probability of being 1 or 0

In [78]:
import pandas as pd

In [80]:
df=pd.read_csv('titanic.csv',usecols=['Cabin','Survived'])

In [81]:
df['Cabin']=df['Cabin'].fillna('Missing')

In [82]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [83]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [84]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [143]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [144]:
ordinal_labels={k:i for i,k in enumerate(index,0)}
ordinal_labels

{'A': 0, 'B': 1, 'C': 2, 'D': 3, 'E': 4, 'F': 5, 'G': 6, 'M': 7, 'T': 8}

In [145]:
df['Cabin']=df['Cabin'].map(ordinal_labels)

In [146]:
df.head()

   Survived  Cabin
0         0      7
1         1      2
2         1      7
3         1      2
4         0      7

### Mean encoding

In [147]:
df=pd.read_csv('titanic.csv',usecols=['Cabin','Survived'])

In [148]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [149]:
df['Cabin'].fillna("Missing",inplace=True)

In [150]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [151]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [152]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [142]:
mean_encoding=df.groupby('Cabin')['Survived'].mean()

In [153]:
df['Cabin']=df['Cabin'].map(mean_encoding)

In [154]:
df.head()

   Survived     Cabin
0         0  0.299854
1         1  0.593220
2         1  0.299854
3         1  0.593220
4         0  0.299854